Exo 30:1-38  "You are to make an altar for burning incense. You are to make it of acacia wood.  (2)  It is to be a square, one and a half feet long and one and a half feet wide, and it is to be three feet high, with its horns of one piece with it.  (3)  You are to overlay it with pure gold, its top, its sides all around, and its horns, and you are to make a molding of gold all around it.  (4)  "You are to make two gold rings for it under its molding; you are to make them on its two opposite sides, and they are to be holders for poles by which to carry it.  (5)  You are to make the poles of acacia wood and overlay them with gold.  (6)  You are to put the altar in front of the curtain that is over the Ark of the Testimony, in front of the Mercy Seat that is over the Testimony where I'll meet with you.  (7)  Aaron is to offer fragrant incense on it. Every morning when he trims the lamps he is to offer it,  (8)  and when Aaron sets up the lamps at twilight, he is to offer it as a continual incense offering in the LORD's presence throughout your generations.  (9)  You are not to offer strange incense, a burnt offering, or a grain offering on it, nor are you to pour out a libation on it.  (10)  Each year Aaron is to make atonement on its horns with the blood of the sin offering of atonement. He is to make atonement on it each year throughout your generations. It is most holy to the LORD.  (11)  The LORD told Moses,  (12)  "When you take a census of the Israelis to register them, each is to give a ransom for himself to the LORD when they're registered so there won't be a plague among them when they're registered.  (13)  This is what everyone who is registered is to give: half a shekel according to the shekel of the sanctuary (the shekel is twenty gerahs), half a shekel as a contribution to the LORD.  (14)  All who are registered, twenty years of age and older, shall give a contribution to the LORD.  (15)  The rich is not to give more nor shall the poor give less than the half shekel, when you give a contribution to the LORD to make atonement for yourselves.  (16)  You are to take the atonement money from the Israelis and give it for the service of the Tent of Meeting, and it is to be a memorial for the Israelis in the LORD's presence to make atonement for yourselves."  (17)  The LORD told Moses,  (18)  "You are to make a bronze basin with a bronze base for washing. You are to put it between the Tent of Meeting and the altar and put water in it,  (19)  and Aaron and his sons shall wash their hands and their feet from it.  (20)  When they enter the Tent of Meeting or when they approach the altar to minister to make an offering by fire to the LORD, they are to wash with water so they don't die.  (21)  They shall wash their hands and their feet so that they don't die, and it is to be for them a perpetual ordinance for Aaron and his seed from generation to generation."  (22)  The LORD told Moses,  (23)  "You are to take for yourself the finest spices: 500 shekels of liquid myrrh, half as much fragrant cinnamon (250 shekels), 250 shekels of fragrant reeds,  (24)  500 shekels of cassia—all according to the shekel of the sanctuary—and a gallon of olive oil.  (25)  You are to make them into a holy anointing oil, a perfume mixture made by a perfumer. It is to be a holy anointing oil.  (26)  "With it you are to anoint the Tent of Meeting, the Ark of the Testimony,  (27)  the table and all its utensils, the lamp stand and its utensils, the altar of incense,  (28)  the altar for burnt offerings and all its utensils, and the basin and its base.  (29)  You are to consecrate them and they are to be most holy. Whatever touches them shall be holy.  (30)  You are to anoint Aaron and his sons, and you are to consecrate them to serve as my priests.  (31)  You are to speak to the Israelis saying, 'This is to be holy anointing oil for me from generation to generation.  (32)  It is not to be poured out on a person's body, nor are you to make anything like it with similar formulations. It is holy, and it is to be holy to you.  (33)  Anyone who mixes anything like it or who puts any of it on an unqualified person is to be cut off from his people.'"  (34)  The LORD told Moses, "Take for yourself spices: stacte, onycha, galbanum, and spices with pure frankincense, all in equal amounts.  (35)  You are to make it into a fragrant incense, expertly blended, pure, and holy.  (36)  You are to grind some of it fine, and put some before the Testimony in the Tent of Meeting where I shall meet with you. It is to be most holy to you.  (37)  You are not to make the incense that you make in this formulation for your own use. It is to be holy to the LORD for you.  (38)  Anyone who makes anything like it to use it as perfume is to be cut off from his people."
