Exo 38:1-31  Then he made the altar for burnt offerings of acacia wood. It was a square, seven and a half feet long and seven and a half feet wide, and it was four and a half feet high.  (2)  He made horns on its four corners. Its horns were of one piece with it, and he overlaid it with bronze.  (3)  He made all the utensils for the altar, the pans, the shovels, the bowls, the forks, and the fire-pans, and he made all its utensils of bronze.  (4)  He made a lattice, a netting of bronze, for the altar. It was under its ledge, extending halfway up.  (5)  He cast four rings on the four ends of the bronze lattice as holders for the poles.  (6)  He made poles of acacia wood and overlaid them with bronze.  (7)  And he put the poles through rings on the sides of the altar to carry it. He made it hollow, out of boards.  (8)  He made the bronze basin and its bronze base from mirrors contributed by the women who served in the doorway of the Tent of Meeting.  (9)  Then he made the court. On the south side the hangings for the court were of fine woven linen, 150 feet long.  (10)  He made their twenty pillars and their twenty sockets of bronze, while the hooks of the pillars and their bands were of silver.  (11)  The north side was 150 feet long, and its 20 pillars and 20 sockets were of bronze, and the hooks of the pillars and their bands were of silver.  (12)  For the west side there were hangings 75 feet long with their ten pillars and ten sockets. The hooks of the pillars and their bands were of silver.  (13)  The east side was 75 feet long.  (14)  The hangings for one section were 22 and a half feet with their three pillars and three sockets,  (15)  and also for the second section. On either side of the gate of the court were hangings of 22 and a half feet with their three pillars and three sockets.  (16)  All the hangings around the court were of fine woven linen.  (17)  The sockets for the pillars were of bronze and the hooks of the pillars and their bands were of silver. Their tops were overlaid with silver, and all the pillars of the court were banded with silver.  (18)  The screen of the gate of the court was the work of an embroiderer of blue, purple and scarlet material, and fine woven linen. The length was 30 feet and it was seven and a half feet high along its width, corresponding to the hangings of the court.  (19)  Their four pillars and their four sockets were of bronze, and their hooks were of silver. Their tops were overlaid with silver and their bands were of silver.  (20)  All the pegs for the tent and for all around the court were of bronze.  (21)  Here is a summary of materials for the Tent of Meeting that was compiled at Moses' direction, the work of the descendants of Levi under the direction of Aaron the priest's son Ithamar.  (22)  Now Uri's son Bezalel, grandson of Hur from the tribe of Judah, made everything that the LORD had ordered Moses to build.  (23)  With him was Ahisamach's son Oholiab from the tribe of Dan, an engraver, designer, and embroiderer in blue, purple, and scarlet material, and of fine linen.  (24)  All the gold that was used in the work, in all the work on the sanctuary, including the gold from the wave offering, totaled 29 talents, 730 shekels, according to the standard used in the sanctuary.  (25)  The silver from those of the congregation who were recorded totaled 100 talents and 1,775 shekels, according to the standard used in the sanctuary;  (26)  a beka a head (a beka is half a shekel, according to the standard used in the sanctuary) for everyone who went through the registration process from 20 years old and older. The total numbered 603,550 bekas.  (27)  One hundred talents of silver were used to cast the sockets for the sanctuary and the sockets for the curtain, 100 sockets for 100 talents, a talent per socket.  (28)  And with 1,775 talents he made hooks for the pillars, overlaid their tops, and made bands for them.  (29)  The bronze from the wave offering totaled 70 talents and 2,400 shekels.  (30)  With it he made the sockets for the doorway to the Tent of Meeting, the bronze altar, the bronze lattice for it, all the furnishings for the altar,  (31)  the sockets for all around the court, the sockets for the gate to the court, all the pegs for the sanctuary, and all the pegs for all around the court.
