Gen 26:1-35  Later on, a famine swept through the land. This famine was different from the previous famine that had occurred earlier, during Abraham's lifetime. So Isaac went to Abimelech, king of the Philistines, at Gerar.  (2)  That's when the LORD appeared to Isaac. "You are not to go down to Egypt," he said. "Instead, you are to settle down in an area within this land where I'll tell you.  (3)  Remain in this land, and I'll be with and bless you by giving all these lands to you and to your descendants in fulfillment of my solemn promise that I made to your father Abraham.  (4)  "I'll cause you to have as many descendants as the stars of the heavens, and I'll certainly give all these lands to your descendants. Later on, through your descendants all the nations of the earth will bless one another.  (5)  I'm going to do this because Abraham did what I told him to do. He kept my instructions, commands, statutes, and laws."  (6)  So Isaac lived in Gerar.  (7)  Later on, the men of that place asked about his wife, so he replied, "She's my sister," because he was afraid to call her "My wife." He kept thinking, "...otherwise, the men around here will kill me on account of Rebekah, since she's very beautiful."  (8)  After he had been there awhile, Abimelech, king of the Philistines, looked out through a window and saw Isaac caressing his wife Rebekah.  (9)  So Abimelech called Isaac and confronted him. "She is definitely your wife!" he accused him, "So why did you claim, 'She's my sister?'" Isaac responded, "Because I had thought '...otherwise, I'll die on account of her.'"  (10)  "What have you done to us?" Abimelech asked. "Any minute now, one of the people could have had sex with your wife and you would have caused all of us to be guilty."  (11)  So he issued this order to everyone: "Whoever touches this man or his wife is to be executed."  (12)  Isaac received a 100-fold return on what he planted that year in the land he received, because the LORD blessed him.  (13)  He became very wealthy and lived a life of wealth, becoming more and more wealthy.  (14)  He owned so many sheep, cattle, and servants that the Philistines eventually became envious of him.  (15)  They filled in with sand all of the wells that Isaac's father Abraham's servants had dug during his lifetime.  (16)  Then Abimelech ordered Isaac, "Move away from us! You've become more powerful than we are."  (17)  So Isaac moved from there and encamped in the Gerar Valley, where he settled.  (18)  Isaac re-excavated some wells that his father had first dug during his lifetime, because the Philistines had filled them with sand after Abraham's death. Isaac renamed those wells with the same names that his father had called them.  (19)  While Isaac's servants were digging in the valley, they discovered a well with flowing water.  (20)  But the herdsmen who lived in Gerar quarreled with Isaac's herdsmen. "The water is ours," they said. As a result, Isaac named the well Esek, for they had fiercely disputed with him about it.  (21)  When his workers started digging another well, those herdsmen quarreled about that one, too, so Isaac named it Sitnah.  (22)  Then he left that area and dug still another well. Because they did not quarrel over that one, Isaac named it Rehoboth, because he used to say, "The LORD has enlarged the territory for us. We will prosper in the land."  (23)  Later on, he left there and went to Beer-sheba,  (24)  where one night the LORD appeared to him. "I am the God of your father Abraham," he told him. "Don't be afraid, because I'm with you. I'm going to bless you and multiply your descendants on account of my servant Abraham."  (25)  In response, Isaac built an altar there and called on the name of the LORD. He also pitched his tents there and his servants dug a well.  (26)  Later, Abimelech traveled to visit Isaac from Gerar. He arrived with Ahuzzath, his staff advisor, and Phicol, the commanding officer of his army.  (27)  "Why have you come to see me," Isaac asked them, "since you hate me so much that you sent me away from you?"  (28)  "We've seen that the LORD is with you," they responded, "so we're proposing an agreement between us—between us and you. Allow us to make a treaty with you  (29)  by which you'll agree not to do us any harm, just as we haven't harmed you, since we've done nothing but good for you after we sent you away in peace. As a result, you've been tremendously blessed by the LORD."  (30)  So Isaac held a feast for them and they ate and drank.  (31)  They woke up early the next morning and made the treaty. After this, Isaac sent them off and they left on peaceful terms.  (32)  That very same day, Isaac's servants arrived and reported to him about a well that they had just completed digging. "We've found water!" they said.  (33)  So Isaac named the well Shebah, which is why the city is named Beer-sheba to this day.  (34)  When Esau was 40 years old, he married Judith, the daughter of Beeri the Hittite and Basemath, the daughter of Elon the Hittite.  (35)  This brought extreme grief to Isaac and Rebekah.
