{
  "book": "Genesis",
  "chapter": 11,
  "version": "ISV",
  "verses": [
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 1,
      "text": "There was a time when the entire earth spoke a common language with an identical vocabulary."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 2,
      "text": "As people migrated westward, they came across a plain in the region of Shinar and settled there."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 3,
      "text": "They told each other, 'Come on! Let's burn bricks thoroughly.' They used bricks for stone and tar for mortar."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 4,
      "text": "Then they said, 'Come on! Let's build ourselves a city and a tower, with its summit in the heavens, and let's make a name for ourselves so we won't be scattered over the surface of the whole earth.'"
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 5,
      "text": "However, the LORD descended to look over the city and the tower that the humans were building."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 6,
      "text": "The LORD said, 'Look! They are one people with the same language for all of them, and this is only the beginning of what they will do. Nothing that they have a mind to do will be impossible for them!"
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 7,
      "text": "Come on! Let's go down there and confuse their language, so that they won't understand each other's speech.'"
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 8,
      "text": "So the LORD scattered them abroad from there over the surface of the whole earth, so that they had to stop building the city."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 9,
      "text": "Therefore it was called Babylon, because there the LORD confused the language of all the earth, and from there the LORD scattered them over the surface of the entire earth."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 11,
      "text": "These are the family records of Shem. When Shem had lived 110 years, he fathered Arpachshad two years after the flood."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 11,
      "text": "Shem lived 500 years after he fathered Arpachshad and had other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 12,
      "text": "When Arpachshad had lived 35 years, he fathered Cainan."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 13,
      "text": "After he fathered Cainan, Arpachshad lived 430 years and had other sons and daughters, and then died. Cainan lived 130 years and fathered Shelah. After he fathered Shelah, Cainan lived 330 years and had other sons and daughters, and then died."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 14,
      "text": "When Shelah had lived 30 years, he fathered Eber."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 15,
      "text": "After he fathered Eber, Shelah lived 403 years and had other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 16,
      "text": "When Eber had lived 34 years, he fathered Peleg."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 17,
      "text": "After he fathered Peleg, Eber lived 430 years and had other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 18,
      "text": "When Peleg had lived 30 years, he fathered Reu."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 19,
      "text": "After he fathered Reu, Peleg lived 209 years and had other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 20,
      "text": "When Reu had lived 32 years, he fathered Serug."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 21,
      "text": "After he fathered Serug, Reu lived 207 years and had other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 22,
      "text": "When Serug had lived 30 years, he fathered Nahor."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 23,
      "text": "After he fathered Nahor, Serug lived 200 years and had other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 24,
      "text": "When Nahor had lived 29 years, he fathered Terah."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 25,
      "text": "After he fathered Terah, Nahor lived 119 years and had other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 26,
      "text": "When Terah had lived 70 years, he fathered Abram, Nahor, and Haran."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 27,
      "text": "Now these are the family records of Terah:  Terah fathered Abram, Nahor, and Haran; and Haran fathered Lot."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 28,
      "text": "Haran died during his father's lifetime in the land of his birth, that is, in Ur of the Chaldeans."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 29,
      "text": "Abram and Nahor took wives for themselves. The name of Abram's wife was Sarai, and the name of Nahor's wife was Milcah. She was the daughter of Haran, who was the father of Milcah and Iscah."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 30,
      "text": "Sarai was barren, so she had not borne children."
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 31,
      "text": "Terah took his son Abram, his grandson Lot"
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": "Haran's son,  and his daughter-in-law Sarai, his son Abram's wife, and they journeyed together from Ur of the Chaldeans to go to the land of Canaan. But when they had gone as far as Haran, they settled there, "
    },
    {
      "book": "Genesis",
      "chapter": 11,
      "verse": 32,
      "text": "where Terah died at the age of 205 years."
    }
  ]
}
