{
  "book": "Genesis",
  "chapter": 5,
  "version": "ISV",
  "verses": [
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 1,
      "text": "This is the historical record of Adam's generations. When God created mankind, he made them in his own likeness."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 2,
      "text": "Creating them male and female, he blessed them and called them humans when he created them."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 3,
      "text": "After Adam had lived 130 years, he fathered a son just like him, that is, according to his own likeness, and named him Seth."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 4,
      "text": "Adam lived another 800 years, fathering other sons and daughters after he had fathered Seth."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 5,
      "text": "Adam lived a total of 930 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 6,
      "text": "When Seth had lived 105 years, he fathered Enosh."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 7,
      "text": "After he fathered Enosh, Seth lived 807 years, fathering other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 8,
      "text": "Seth lived a total of 912 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 9,
      "text": "When Enosh had lived 90 years, he fathered Kenan."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 10,
      "text": "After he fathered Kenan, Enosh lived 815 years, fathering other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 11,
      "text": "Enosh lived a total of 905 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 12,
      "text": "When Kenan had lived 70 years, he fathered Mahalalel."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 13,
      "text": "After he fathered Mahalalel, Kenan lived 840 years, fathering other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 14,
      "text": "Kenan lived a total of 910 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 15,
      "text": "When Mahalalel had lived 65 years, he fathered Jared."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 16,
      "text": "After he fathered Jared, Mahalalel lived 830 years, fathering other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 17,
      "text": "Mahalalel lived a total of 895 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 18,
      "text": "When Jared had lived 162 years, he fathered Enoch."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 19,
      "text": "After he fathered Enoch, Jared lived 800 years, fathering other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 20,
      "text": "Jared lived a total of 962 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 21,
      "text": "When Enoch had lived 65 years, he fathered Methuselah."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 22,
      "text": "After he fathered Methuselah, Enoch communed with God for 300 years and fathered other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 23,
      "text": "Enoch lived a total of 365 years,"
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 24,
      "text": "communing with God—and then he was there no more, because God had taken him."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 25,
      "text": "When Methuselah had lived 187 years, he fathered Lamech."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 26,
      "text": "After he fathered Lamech, Methuselah lived 782 years, fathering other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 27,
      "text": "Methuselah lived a total of 969 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 28,
      "text": "When Lamech had lived 182 years, he fathered a son,"
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 29,
      "text": "whom he named Noah, because he said, 'May this one comfort us from our work, from pain that is caused by our manual labor, and from the ground that the LORD has cursed.'"
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 30,
      "text": "After he fathered Noah, Lamech lived 595 years, fathering other sons and daughters."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 31,
      "text": "Lamech lived a total of 777 years and then died."
    },
    {
      "book": "Genesis",
      "chapter": 5,
      "verse": 32,
      "text": "After Noah had lived 500 years, he fathered Shem, Ham, and Japheth."
    }
  ]
}
