{
  "book": "Genesis",
  "chapter": 9,
  "version": "ISV",
  "verses": [
    {
      "book": "Genesis",
      "chapter": 9,
      "verse": 1,
      "text": "God blessed Noah and his sons and ordered them, 'Be productive, multiply, and fill the earth."
    },
    {
      "verse": 2,
      "text": "All the living creatures of the earth will be filled with fear and terror of you from now on, including all the birds of the sky, everything that crawls on the ground, and all the fish of the ocean. They've been assigned to live under your dominion."
    },
    {
      "verse": 3,
      "text": "'Every living, moving creature will be food for you. Just as I gave you green plants before, so now you have everything."
    },
    {
      "verse": 4,
      "text": "However, you are not to eat meat with its life—that is, its blood—in it!"
    },
    {
      "verse": 5,
      "text": "Also, I will certainly demand an accounting regarding bloodshed, from every animal and from every human being. I'll demand an accounting from every human being for the life of another human being."
    },
    {
      "verse": 6,
      "text": "'Whoever sheds human blood, by a human his own blood is to be shed; because God made human beings in his own image."
    },
    {
      "verse": 7,
      "text": "Now as for you, be productive and multiply; spread out over the land and multiply throughout it.'"
    },
    {
      "verse": 8,
      "text": "Later, God told Noah and his sons,"
    },
    {
      "verse": 9,
      "text": "'Pay attention! I'm establishing my covenant with you and with your descendants after you,"
    },
    {
      "verse": 10,
      "text": "and with every living creature that is with you—the birds, the livestock, and all the wildlife of the earth that are with you—all the earth's animals that came out of the ark."
    },
    {
      "verse": 11,
      "text": "I will establish my covenant with you: No living beings will ever be cut off again by flood waters, and there will never again be a flood that destroys the earth.'"
    },
    {
      "verse": 12,
      "text": "God also said, 'Here's the symbol that represents the covenant that I'm making between me and you and every living being with you, for all future generations:"
    },
    {
      "verse": 13,
      "text": "I've set my rainbow in the sky to symbolize the covenant between me and the earth."
    },
    {
      "verse": 14,
      "text": "Whenever I bring clouds over the earth and the rainbow becomes visible in the clouds,"
    },
    {
      "verse": 15,
      "text": "I'll remember my covenant between me and you and every living creature, so that water will never again become a flood to destroy all living beings."
    },
    {
      "verse": 16,
      "text": "When the rainbow is in the clouds, I will observe it and remember the everlasting covenant between God and all living beings on the earth.'"
    },
    {
      "verse": 17,
      "text": "God also told Noah, 'This is the symbol of the covenant that I've established between me and everything that lives on the earth.'"
    },
    {
      "verse": 18,
      "text": "Noah's sons who came out of the ark were Shem, Ham, and Japheth. (Ham later fathered Canaan.)"
    },
    {
      "verse": 19,
      "text": "These three were Noah's sons, and from these men the whole earth was re-populated."
    },
    {
      "verse": 20,
      "text": "Noah, a man of the soil, was the first to plant and farm a vineyard."
    },
    {
      "verse": 21,
      "text": "He drank some of the wine, got drunk, and lay down naked right in the middle of his tent."
    },
    {
      "verse": 22,
      "text": "Ham, who fathered Canaan, saw his father's genitals and told his two brothers outside."
    },
    {
      "verse": 23,
      "text": "Then Shem and Japheth took their father's cloak, laid it across both their shoulders, and walking backwards, they both covered their father's genitals. Their faces were turned away, and they did not see their father's genitals."
    },
    {
      "verse": 24,
      "text": "When Noah sobered up and learned what his youngest son had done to him,"
    },
    {
      "verse": 25,
      "text": "he said, 'Canaan is cursed! He will be the lowest of slaves to his relatives.'"
    },
    {
      "verse": 26,
      "text": "He also said, 'Blessed be the LORD God of Shem, and may Canaan be his slave."
    },
    {
      "verse": 27,
      "text": "May God make room for Japheth; may God live in Shem's tents, and may Canaan serve him.'"
    },
    {
      "verse": 28,
      "text": "Noah lived 350 years after the flood."
    },
    {
      "verse": 29,
      "text": "After Noah had lived a total of 950 years, he died."
    }
  ]
}
