{
  "book": "Genesis",
  "chapter": 1,
  "version": "ISV",
  "verses": [
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 1,
      "text": "In the beginning, God created the universe."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 2,
      "text": "When the earth was as yet unformed and desolate, with the surface of the ocean depths shrouded in darkness, and while the Spirit of God was hovering over the surface of the waters,"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 3,
      "text": "God said, 'Let there be light!' So there was light."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 4,
      "text": "God saw that the light was beautiful. He separated the light from the darkness,"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 5,
      "text": "calling the light 'day,' and the darkness 'night.' The twilight and the dawn were day one."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 6,
      "text": "Then God said, 'Let there be a canopy between bodies of water, separating bodies of water from bodies of water!'"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 7,
      "text": "So God made a canopy that separated the water beneath the canopy from the water above it. And that is what happened:"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 8,
      "text": "God called the canopy 'sky.' The twilight and the dawn were the second day."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 9,
      "text": "Then God said, 'Let the water beneath the sky come together into one area, and let dry ground appear!' And that is what happened:"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 10,
      "text": "God called the dry ground 'land,' and he called the water that had come together 'oceans.' And God saw how good it was."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 11,
      "text": "Then God said, 'Let vegetation sprout all over the earth, including seed-bearing plants and fruit trees, each kind containing its own seed!' And that is what happened:"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 12,
      "text": "Vegetation sprouted all over the earth, including seed-bearing plants and fruit trees, each kind containing its own seed. And God saw that it was good."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 13,
      "text": "The twilight and the dawn were the third day."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 14,
      "text": "Then God said, 'Let there be lights across the sky to distinguish day from night, to act as signs for seasons, days, and years,"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 15,
      "text": "to serve as lights in the sky, and to shine on the earth!' And that is what happened:"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 16,
      "text": "God fashioned two great lights—the larger light to shine during the day and the smaller light to shine during the night—as well as the stars."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 17,
      "text": "God placed them in the sky to shine on the earth,"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 18,
      "text": "to shine both day and night, and to distinguish light from darkness. And God saw how good it was."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 19,
      "text": "The twilight and the dawn were the fourth day."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 20,
      "text": "Then God said, 'Let the oceans swarm with living creatures, and let birds fly above the earth throughout the sky!'"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 21,
      "text": "So God created every kind of magnificent marine creature, every kind of living marine crawler with which the waters swarmed, and every kind of flying bird. And God saw how good it was."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 22,
      "text": "God blessed them by saying, 'Be fruitful, multiply, and fill the oceans. Let the birds multiply throughout the earth!'"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 23,
      "text": "The twilight and the dawn were the fifth day."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 24,
      "text": "Then God said, 'Let the earth bring forth each kind of living creature, each kind of livestock and crawling thing, and each kind of earth's animals!' And that is what happened:"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 25,
      "text": "God made each kind of the earth's animals, along with every kind of livestock and crawling thing. And God saw how good it was."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 26,
      "text": "Then God said, 'Let us make mankind in our image, to be like us. Let them be masters over the fish in the ocean, the birds that fly, the livestock, everything that crawls on the earth, and over the earth itself!'"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 27,
      "text": "So God created mankind in his own image; in his own image God created them; he created them male and female."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 28,
      "text": "God blessed these humans by saying to them, 'Be fruitful, multiply, fill the earth, and subdue it! Be masters over the fish in the ocean, the birds that fly, and every living thing that crawls on the earth!'"
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 29,
      "text": "God also told them, 'Look! I have given you every seed-bearing plant that grows throughout the earth, along with every tree that grows seed-bearing fruit. They will produce your food."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 30,
      "text": "I have given all green plants as food for every wild animal of the earth, every bird that flies, and to every living thing that crawls on the earth.' And that is what happened."
    },
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 31,
      "text": "Now God saw all that he had made, and indeed, it was very good! The twilight and the dawn were the sixth day."
    }
  ]
}
