{
  "book": "Genesis",
  "chapter": 4,
  "version": "ISV",
  "verses": [
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 1,
      "text": "Later, Adam had sexual relations with his wife Eve. She became pregnant and gave birth to Cain. She said, 'I have given birth to a male child with the LORD.'"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 2,
      "text": "She also gave birth to his brother Abel. Abel shepherded flocks and Cain became a farmer."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 3,
      "text": "Later, Cain brought an offering to the LORD from the fruit that he had harvested,"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 4,
      "text": "while Abel offered the best parts of some of the firstborn from his flock. The LORD looked favorably upon Abel and his offering,"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 5,
      "text": "but he did not look favorably upon Cain and his offering. When Cain became very upset and depressed,"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 6,
      "text": "the LORD asked Cain, 'Why are you so upset? Why are you depressed?"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 7,
      "text": "If you do what is appropriate, you'll be accepted, won't you? But if you don't do what is appropriate, sin is crouching near your doorway, turning toward you. However, you must take dominion over it.'"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 8,
      "text": "Instead, Cain told his brother Abel, 'Let's go out to the wilderness.' When they were outside in the fields, Cain attacked his brother Abel and killed him."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 9,
      "text": "Later, the LORD asked Cain, 'Where's your brother Abel?' 'I don't know,' he answered. 'Am I my brother's guardian?'"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 10,
      "text": "'What did you do?' God asked. 'Your brother's blood cries out to me from the ground."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 11,
      "text": "Now you're more cursed than the ground, which has opened to receive your brother's blood from your hand."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 12,
      "text": "Whenever you work the ground, it will no longer yield its produce to you, and you'll wander throughout the earth as a fugitive.'"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 13,
      "text": "'My punishment is too great to bear,' Cain told the LORD."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 14,
      "text": "'You're driving me from the soil today. I'll be hidden from you, and I'll wander throughout the earth as a fugitive. In the future, whoever finds me will kill me.'"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 15,
      "text": "The LORD told him, 'This won't happen, because whoever kills you will suffer seven times the vengeance.' Then the LORD placed a sign on Cain so that no one finding him would kill him."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 16,
      "text": "After this, Cain left the presence of the LORD and settled in the land of Nod, east of Eden."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 17,
      "text": "Later, Cain had sexual relations with his wife. She became pregnant and gave birth to Enoch. Cain founded a city and named it after his son Enoch."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 18,
      "text": "Irad was born to Enoch. Irad fathered Mehujael, and Mehujael fathered Methushael, and Methushael fathered Lamech."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 19,
      "text": "Later, Lamech married two wives. One was named Adah and the other was named Zillah."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 20,
      "text": "Adah gave birth to Jabal, who became the ancestor of those who live in tents and herd livestock."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 21,
      "text": "His brother was named Jubal; he became the ancestor of all those who play the lyre and the flute."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 22,
      "text": "Zillah gave birth to Tubal-cain, who became a forger of bronze and iron work. Tubal-cain's sister was Naamah."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 23,
      "text": "Lamech told his wives, 'Adah and Zillah, listen to what I have to say: You wives of Lamech, hear what I'm announcing! I've killed a man for wounding me, a young man for bruising me."
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 24,
      "text": "For if Cain is being avenged seven times, then Lamech will be avenged 77 times.'"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 25,
      "text": "Later on, after Adam had sexual relations with his wife, she gave birth to a son and named him Seth, because 'God granted me another offspring to replace Abel, since Cain murdered him.'"
    },
    {
      "book": "Genesis",
      "chapter": 4,
      "verse": 26,
      "text": "Seth also fathered a son, whom he named Enosh. At that time, profaning the name of the LORD began."
    }
  ]
}
