Gen 6:1-22  Now after the population of human beings had increased throughout the earth, and daughters had been born to them,  (2)  some divine beings noticed how attractive human women were, so they took wives for themselves from a selection that pleased them.  (3)  So the LORD said, "My Spirit won't remain with human beings forever, because they're truly mortal. Their lifespan will be 120 years."  (4)  The Nephilim were on the earth at that time (and also immediately afterward), when those divine beings were having sexual relations with those human women, who gave birth to children for them. These children became the heroes and legendary figures of ancient times.  (5)  The LORD saw that human evil was growing more and more throughout the earth, with every inclination of people's thoughts becoming only evil on a continuous basis.  (6)  Then the LORD regretted that he had made human beings on the earth, and he was deeply grieved about that.  (7)  So the LORD said, "I will annihilate these human beings whom I've created from the earth, including people, animals, crawling things, and flying birds, because I'm grieving that I made them."  (8)  The LORD was pleased with Noah, however.  (9)  These are the family records of Noah: Noah was a righteous man. Blameless during his times, Noah communed with God.  (10)  Noah fathered three sons: Shem, Ham, and Japheth.  (11)  By this time, the earth had become ruined in God's opinion and filled with violence.  (12)  God looked at the earth, observing how corrupt its population had become, because the entire human race had corrupted itself.  (13)  So God announced to Noah, "I've decided to destroy every living thing on earth, because it has become filled with violence due to them. Look! I'm about to annihilate them, along with the earth.  (14)  So make yourself an ark out of cedar, constructing compartments in it, and cover it inside and out with tar.  (15)  Make the ark like this: 450 feet long, 75 feet wide, and 45 feet high.  (16)  Make a roof for the ark, and finish the walls to within one and a half feet from the top. Place the entrance in the side of the ark, and build a lower, a middle, and an upper deck.  (17)  "For my part, I'm about to flood the earth with water and destroy every living thing that breathes. Everything on earth will die.  (18)  However, I will establish my own covenant with you, and you are to enter the ark—you, your sons, your wife, and your sons' wives.  (19)  You are to bring two of every living thing into the ark so they may remain alive with you. They are to be male and female.  (20)  From birds according to their species, from domestic animals according to their species, and from everything that crawls on the ground according to their species—two of everything will come to you so they may remain alive.  (21)  For your part, take some of the edible food and store it away—these stores will be food for you and the animals."  (22)  Noah did all of this, precisely as God had commanded.
