Exo 4:1-31  Then Moses answered, "Look, they won't believe me and they won't listen to me. Instead, they'll say, 'The LORD didn't appear to you.'"  (2)  "What's that in your hand?" the LORD asked him. Moses answered, "A staff."  (3)  Then God said, "Throw it on the ground." He threw it on the ground and it became a snake. Moses ran away from it.  (4)  Then God told Moses, "Reach out and grab its tail." So he reached out, grabbed it, and it became a staff in his hand.  (5)  God said, "I've done this so that they may believe that the LORD, the God of their ancestors—the God of Abraham, the God of Isaac, and the God of Jacob—has appeared to you."  (6)  Again the LORD told him, "Put your hand into your bosom." He put his hand into his bosom and as soon as he brought it out it was leprous, like snow.  (7)  Then God said, "Put your hand back into your bosom." He returned it to his bosom and as soon as he brought it out, it was restored like the rest of his skin.  (8)  "Then if they don't believe you and respond to the first sign, they may respond to the second sign.  (9)  But if they don't believe even these two signs, and won't listen to you, then take some water out of the Nile and pour it on the dry ground. The water you took from the Nile will turn into blood on the dry ground."  (10)  Then Moses told the LORD, "Please, LORD, I'm not eloquent. I never was in the past nor am I now since you spoke to your servant. In fact, I talk too slowly and I have a speech impediment."  (11)  Then God asked him, "Who gives a person a mouth? Who makes him unable to speak, or deaf, or able to see, or blind, or lame? Is it not I, the LORD?  (12)  Now, go! I myself will help you with your speech, and I'll teach you what you are to say."  (13)  Moses said, "Please, LORD, send somebody else."  (14)  Then the LORD was angry with Moses and said, "There is your brother Aaron, the descendant of Levi, isn't there? I know that he certainly is eloquent. Right now he's coming to meet you and he will be pleased to see you.  (15)  You're to speak to him and tell him what to say. I'll help both you and him with your speech, and I'll teach both of you what you are to do.  (16)  He is to speak to the people for you as your spokesman and you are to act in the role of God for him.  (17)  Now pick up that staff with your hand. You'll use it to perform the signs."  (18)  Moses left and returned to his father-in-law Jethro. Moses told him, "Please let me go and return to my own people in Egypt so I can see whether they're still alive." Jethro told Moses, "Go in peace."  (19)  The LORD told Moses in Midian, "Go back to Egypt, because all the men who wanted to kill you are dead."  (20)  So Moses took his wife and son, put them on the donkey, and headed back to the land of Egypt. Moses took the staff of God in his hand.  (21)  Then the LORD told Moses, "When you set out to return to Egypt, keep in mind all the wonders that I've put in your power, so that you may do them before Pharaoh. But I'll harden his heart so that he won't let the people go.  (22)  You are to say to Pharaoh, 'This is what the LORD says: "Israel is my firstborn son.  (23)  And I say to you, 'Let my son go so he may serve me.' If you refuse to let him go, then I will kill your firstborn son."'"  (24)  But later on, at the lodging place along the way, the LORD met Moses and was about to kill him.  (25)  Zipporah took a flint knife, cut off her son's foreskin, and touched Moses' feet with it, saying while doing so, "...because you are a bridegroom of blood to me."  (26)  Then the LORD withdrew from him, and she said, "...a bridegroom of blood because of circumcision."  (27)  The LORD told Aaron, "Go meet Moses in the desert." So Aaron went, found him at the mountain of God, and kissed him.  (28)  Moses told Aaron all of the LORD's messages that he had sent with Moses, and all of the signs that he commanded him to do.  (29)  Later, Moses and Aaron brought together all the elders of the Israelis.  (30)  Aaron spoke everything that the LORD had spoken to Moses, and Moses performed the miracles before the very eyes of the people.  (31)  The people believed and understood that the LORD had paid attention to the Israelis and had seen their affliction. They bowed their heads and prostrated themselves in worship.
