Exo 27:1-21  "You are to make the altar of acacia wood. It is to be seven and a half feet long, seven and a half feet wide; the altar is to be a square, and it is to be four and a half feet high.  (2)  You are to make horns on its four corners. Its corners shall be of one piece with it, and you are to overlay it with bronze.  (3)  You are to make pans for removing its ashes, shovels, bowls, forks, and fire-pans for it, and you are to make all its utensils of bronze.  (4)  You are to make a lattice, a netting of bronze for it, and you are to make four bronze rings on the netting at its four corners.  (5)  You are to put it under the ledge of the altar, so that the netting extends halfway up the altar.  (6)  You are to make poles for the altar, poles of acacia wood, and you are to overlay them with bronze.  (7)  The poles for it shall be put through the rings, so the poles will be on the two sides of the altar when it's carried.  (8)  You are to make it hollow out of boards—just as it was shown you on the mountain, so they are to make it."  (9)  "You are to make the court of the tent. On the south side there shall be hangings of fine woven linen for the court, 150 feet long on one side.  (10)  It is to have twenty pillars, with twenty bronze sockets, and the hooks of the pillars and their bands shall be of silver.  (11)  Likewise for the length of the north side there shall be hangings 150 feet long, and it is to have twenty pillars with twenty bronze sockets, and the hooks of the pillars and their bands shall be of silver.  (12)  "The width of the court on the west side is to have hangings 75 feet long with ten pillars and ten sockets.  (13)  The width of the court on the east side is to be 75 feet.  (14)  The hangings for the one section shall be twenty-two and a half feet, with their three pillars and three sockets.  (15)  "For the second section there shall be hangings of twenty-two and a half feet with their three pillars and three sockets.  (16)  There is to be a screen of 30 feet of blue, purple, and scarlet material and fine woven linen, the work of an embroiderer, for the gate of the court, and it is to have four pillars and four sockets.  (17)  All the pillars around the court shall be banded with silver. Their hooks shall be of silver and their sockets of bronze.  (18)  The length of the court is to be 150 feet, the width 75 feet, and the height seven and a half feet, with the hangings of fine woven linen, and the sockets of bronze.  (19)  All the utensils of the tent for its service, all its pegs, and all the pegs for the court shall be of bronze."  (20)  "And you are to command the Israelis to bring you pure olive oil, extracted by hand, for the light in order to keep the lamp burning continually.  (21)  In the Tent of Meeting, outside the curtain that is before the Testimony, Aaron and his sons shall maintain the lamp stand from evening until morning in the LORD's presence. It is to be a perpetual ordinance from generation to generation among the Israelis."
