Gen 16:1-16  Now Abram's wife Sarai had not borne a child for him. She had an Egyptian servant girl whose name was Hagar.  (2)  So Sarai told Abram, "You are well aware that the LORD has prevented me from giving birth to a child. Go have sex with my servant, so that I may possibly bear a son through her." Abram listened to Sarai's suggestion,  (3)  so Abram's wife Sarai took her Egyptian servant, Hagar, and gave her as a wife to her husband Abram. This took place ten years after Abram had settled in the land of Canaan.  (4)  He had sex with Hagar, and she became pregnant. When she realized that she was pregnant, she looked with contempt on her mistress.  (5)  Then Sarai told Abram, "My suffering is your fault! I gave you my servant so you could have sex with her, and when she discovered that she was pregnant, she looked on me with contempt. May the LORD judge between you and me!"  (6)  Abram answered Sarai, "Look, your servant is under your control, so do to her as you wish." So Sarai dealt so harshly with Hagar that she ran away from Sarai.  (7)  The angel of the LORD found her by a spring of water in the desert on the road to Shur.  (8)  "Hagar, servant of Sarai," he asked, "Where are you coming from and where are you going?" She answered, "I am running away from my mistress Sarai."  (9)  The angel of the LORD told her, "You must go back to your mistress and submit to her authority."  (10)  The angel of the LORD also told her, "I will greatly multiply your offspring, who will be too many to count.  (11)  "Look, you are pregnant and will give birth to a son," the angel of the LORD continued to say to her. "You will name him Ishmael, because the LORD has heard your cry of misery.  (12)  He'll be a wild donkey of a man. He'll be against everyone, and everyone will be against him. He will live in conflict with all of his relatives."  (13)  So she called the name of LORD who spoke to her, "You are 'God who sees,' because I have truly seen the one who looks after me."  (14)  That's is why the spring was called, "The Well of the Living One who looks after me." It was between Kadesh and Bered.  (15)  Hagar eventually gave birth to Abram's son. Abram named his son whom Hagar bore Ishmael.  (16)  Abram was 86 years old when Hagar gave birth to Ishmael for Abram.
