{
  "book": "Genesis",
  "chapter": 2,
  "version": "ISV",
  "verses": [
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 1,
      "text": "With this the heavens and the earth were completed, including all of their vast array."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 2,
      "text": "By the seventh day God had completed the work he had been doing, so on the seventh day he stopped working on everything that he had done."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 3,
      "text": "Then God blessed the seventh day and made it holy, because on it God stopped working on everything that he had been creating."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 4,
      "text": "These are the records of how the heavens and the earth were created. On the day that the LORD God made the earth and the heavens,"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 5,
      "text": "no shrubs had yet grown in the meadows of the earth and no vegetation had sprouted, because the LORD God had not sent rain on the earth and there were no human beings to work the ground."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 6,
      "text": "Instead, an underground stream would rise from the earth and water the surface of the ground."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 7,
      "text": "So the LORD God formed the man from the dust of the ground, breathed life into his lungs, and the man became a living being."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 8,
      "text": "The LORD God planted a garden in Eden, toward the east, where he placed the man whom he had formed."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 9,
      "text": "The LORD God caused every tree that is both beautiful and suitable for food to spring up out of the ground. The tree of life was also in the middle of the garden, along with the tree of the knowledge of good and evil."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 10,
      "text": "A river flows from Eden to water the garden, and from there it divides, becoming four branches."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 11,
      "text": "The name of the first one is Pishon—it winds through the entire land of Havilah, where there is gold."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 12,
      "text": "The gold of that land is pure; bdellium and onyx are also found there."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 13,
      "text": "The name of the second river is Gihon—it winds through the entire land of Cush."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 14,
      "text": "The third river is named the Tigris—it flows to the east of Assyria. The fourth river is the Euphrates."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 15,
      "text": "The LORD God took the man and placed him in the Garden of Eden in order to have him work it and guard it."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 16,
      "text": "The LORD God commanded the man: 'You may freely eat from every tree of the garden,"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 17,
      "text": "but you are not to eat from the tree of the knowledge of good and evil, because you will certainly die during the day that you eat from it.'"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 18,
      "text": "Later, the LORD God said, 'It is not good for the man to be alone. I will make for him a companion that is a suitable match for him.'"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 19,
      "text": "After the LORD God formed from the ground every wild animal and every bird that flies, he brought each of them to the man to see what he would call it. Whatever the man called each living creature became its name."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 20,
      "text": "The man gave names to all the livestock, to the birds that fly, and to each of earth's animals, but there was not found for the man any companion corresponding to him,"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 21,
      "text": "so the LORD God caused a deep sleep to overshadow the man. When the man was asleep, he removed one of the man's ribs and closed up the flesh where it had been."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 22,
      "text": "Then the LORD God formed the rib that he had taken from the man into a woman and brought her to the man."
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 23,
      "text": "So the man exclaimed, 'At last! This is bone from my bones and flesh from my flesh. This one will be called 'Woman,' because she was taken from Man.'"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 24,
      "text": "(Therefore a man will leave his father and his mother and cling to his wife, and they will become one flesh.)"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 25,
      "text": "Even though both the man and his wife were naked, they were not ashamed about it."
    }
  ]
}
