{
  "book": "Leviticus",
  "chapter": 11,
  "version": "ISV",
  "verses": [
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 1,
      "text": "The LORD spoke to Moses and Aaron:"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 2,
      "text": "'Tell the Israelis, 'These are the living creatures that you may eat among the animals of the earth."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 3,
      "text": "You may eat any animal that has divided hooves with cloven feet and that ruminates its cud,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 4,
      "text": "except you are not to eat the following animals that have divided hooves or ruminate their cud: the camel (because it chews the cud but doesn't have divided hooves) is to be unclean for you;"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 5,
      "text": "the rock badger (because it chews its cud but its hooves aren't divided) is to be unclean for you;"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 6,
      "text": "the hare (because it chews its cud, but its hooves aren't divided) is to be unclean for you;"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 7,
      "text": "the pig (because it has divided hooves and is therefore cloven footed, but it doesn't ruminate its cud), is to be unclean for you."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 8,
      "text": "You are not to eat its flesh or even touch their carcasses. They are to be unclean for you.''"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 9,
      "text": "'You may eat anything that's in the waters; that is, you may eat anything that has fins and scales either from the seas or from the rivers."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 10,
      "text": "But anything that doesn't have fins or scales—whether from the seas or the rivers—any of the swarming creatures and living creatures in the waters are detestable for you."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 11,
      "text": "They are to be detestable for you. You are not to eat of their meat and you are to detest their carcasses."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 12,
      "text": "Anything that doesn't have fins or scales in the waters is a detestable thing for you.'"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 13,
      "text": "'These are detestable things for you among winged creatures that you are not to eat, because they are detestable for you: the eagle, vulture, osprey,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 14,
      "text": "red kite, falcon of any kind,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 15,
      "text": "every kind of raven,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 16,
      "text": "ostrich, nighthawk, sea gull, hawk of every kind,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 17,
      "text": "owl, cormorant, ibis,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 18,
      "text": "water-hen, pelican, carrion,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 19,
      "text": "stork, heron of every kind, hoopoe, bat,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 20,
      "text": "and any winged insect that crawls on four legs is detestable for you."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 21,
      "text": "'However, you may eat winged creatures that crawl on four legs that extend over its head and by which it hops on the ground."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 22,
      "text": "These creatures that you may eat include the locust of any kind, the bald locust of any kind, the cricket of any kind, and the grasshopper of any kind."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 23,
      "text": "But any other winged insect that has four legs is detestable for you"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 24,
      "text": "and are unclean. Anyone who touches their carcasses becomes unclean until evening."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 25,
      "text": "And anyone who carries their carcasses is to wash his clothes, since he will remain unclean until evening.'"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 26,
      "text": "'Any animal that has divided hooves and is cloven-footed but doesn't chew the cud is unclean for you. Anyone who touches them is unclean."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 27,
      "text": "Among the animals, anything that walks on their paws and on four legs is unclean for you. Anyone who touches their carcasses becomes unclean until evening."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 28,
      "text": "Whoever carries their carcass is to wash their clothes, because they've become unclean until evening. They're unclean for you."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 29,
      "text": "'These are unclean for you among the swarming creatures that crawl over the land: the rat, mouse, lizards of every kind,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 30,
      "text": "the gecko, crocodile, lizard, sand lizard, and chameleon."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 31,
      "text": "These are unclean for you among the swarming creatures, so anyone who touches them when they're dead becomes unclean until evening."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 32,
      "text": "'Furthermore, anything on which they fall upon when they're dead becomes unclean, whether on an article of wood, clothing, skin, or a sack. And any vessel used for any work is to be washed in water, because it has become unclean until evening."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 33,
      "text": "Any earthen vessel in which any of these things fall becomes unclean, along with everything in it. You are to destroy it, along with all its contents.'"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 34,
      "text": "'Any food that may be eaten, but which water has soaked in, becomes unclean. Any drink, which may be drunk in any of these vessels becomes unclean."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 35,
      "text": "And anything in which their carcass falls on becomes unclean. An oven or stove is to be broken in pieces. They're unclean and therefore unclean for you."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 36,
      "text": "'A spring or a cistern that holds water is clean, but whoever touches the carcass of an unclean animal will be unclean."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 37,
      "text": "If their carcass falls on a seed, which is for sowing, what is to be sown is clean."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 38,
      "text": "But if water is put on the seed and part of their carcass falls on it, then it has become unclean for you."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 39,
      "text": "'If any of the animals that you may eat dies, the one who touches its carcass becomes unclean until evening."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 40,
      "text": "The one who eats from its carcass is to wash his clothes, because he has become unclean until evening. Even the one who carries the carcass is to wash his clothes, because he has become unclean until evening.'"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 41,
      "text": "'Every swarming thing that swarms the land is detestable for you. It is not to be eaten."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 42,
      "text": "You are not to eat anything that crawls on its belly, anything that walks on four legs, anything that has many legs, and all the swarming creatures that swarm the land, because they're detestable."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 43,
      "text": "'You are not to make yourselves detestable on account of any swarming creature that swarms the land. And you are not to defile yourselves and become unclean because of them,"
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 44,
      "text": "because I, the LORD, am your God. 'Set yourselves apart and be holy, because I am holy. You are not to defile yourselves with any of the swarming creatures that swarm the earth."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 45,
      "text": "'I am the LORD your God who brought you out of the land of Egypt to be your God. Be holy, because I am holy."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 46,
      "text": "This is the law concerning animals, every living creature that moves on the waters or swarms on land."
    },
    {
      "chapter": 11,
      "book": "Leviticus",
      "verse": 47,
      "text": "You are to differentiate between the clean and unclean, between the living creature that can be eaten and the living creature that is not to be eaten."
    }
  ]
}
