{
  "book": "Leviticus",
  "chapter": 25,
  "version": "ISV",
  "verses": [
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 1,
      "text": "The LORD spoke to Moses on Mount Sinai."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 2,
      "text": "'Tell the Israelis that when you enter the land that I'm about to give you, you are to let the land observe a Sabbath to the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 3,
      "text": "For six years you may plant your fields, and for six years you may prune your vineyard and gather its produce."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 4,
      "text": "'But the seventh year is to be a Sabbath of rest for the land—a Sabbath for the LORD. You are not to plant your field or prune your vineyard."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 5,
      "text": "You are not to gather what grows from the spilled kernels of your crops. You are not to pick the grapes of your untrimmed vines. Let it be a year of Sabbath for the land."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 6,
      "text": "You may take the Sabbath produce of the land for your food—you, your male and maid servants, your hired laborers, and the resident alien with you."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 7,
      "text": "The cattle and the wild animals in your land—everything it produces—are for your food."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 8,
      "text": "'Count for yourselves seven years of Sabbaths, seven times seven years. This set of seven weeks of years total forty nine years for you."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 9,
      "text": "Sound a horn on the tenth day of the seventh month of this fiftieth year. Likewise on the Day of Atonement sound the horn throughout your land."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 10,
      "text": "'Set aside and consecrate the fiftieth year to declare liberty throughout the land for all of its inhabitants. It is to be a jubilee for you. Every person is to return to his own land that he has inherited. 'Likewise, every person is to return to his clan."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 11,
      "text": "The fiftieth year is to be a year of jubilee for you. You are not to sow or harvest the spilled kernels that grow of itself or pick grapes from the untrimmed vines"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 12,
      "text": "because it's jubilee. It's sacred for you. But you may eat its produce from the field."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 13,
      "text": "'During this year of jubilee, each person is to return to his own land that he has inherited."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 14,
      "text": "So if you had sold property to a neighbor or had acquired land from your neighbor, you are not to cheat one another."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 15,
      "text": "According to the number of years after the jubilee, you may buy from your neighbor. And according to the number of years with crops, he may sell to you."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 16,
      "text": "If the number of years are more, increase the selling price. If the years be few, decrease its selling price, because he's selling to you according to the volume of produce."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 17,
      "text": "No one is to cheat his neighbor. Instead, you are to fear your God, because I am the LORD your God."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 18,
      "text": "'Observe my statutes and keep my ordinances. Do them so that you may live securely in the land."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 19,
      "text": "Then the land will yield its fruit and you'll eat to your satisfaction and live securely."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 20,
      "text": "'Now if you ask, 'What will we eat during the seventh year? After all, we may not plant or even gather our produce!'"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 21,
      "text": "I'll command my blessing on you during the sixth year so that it will yield produce for three years!"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 22,
      "text": "That way, you are to sow in the eighth year, eating the produce from the old harvest. Until the ninth year when its produce comes in, you'll eat from the old harvest.'"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 23,
      "text": "'The land is not to be sold with any finality, because the land belongs to me. You're sojourners and travelers with me."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 24,
      "text": "So throughout all of your land inheritance, grant the right of redemption for the land."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 25,
      "text": "'If your brother is poor so that he had to a sell portion of his inheritance, then his nearest kinsman redeemer is to come and redeem what his brother has sold."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 26,
      "text": "If a person doesn't have a kinsman redeemer but has become rich and found sufficient means for his redemption,"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 27,
      "text": "then let him account for the years for which it was sold, return the excess to the person to whom it was sold, and then return to his property."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 28,
      "text": "If he's not able to redeem it back for himself, then what he sold is to remain in the hand of the buyer until the year of jubilee. In the jubilee, it is to be returned so he may return to his property."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 29,
      "text": "'If a person sells a residential house in a walled city, then he is to redeem it within the year in which it was sold. He may have right to its redemption for a full year."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 30,
      "text": "But if it's not redeemed by the end of a full year, then the house next to which is a wall is to belong to the one who bought it, in perpetuity throughout his generations. It is not to be returned in the jubilee."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 31,
      "text": "'However, the houses in the villages that don't have walls around them are to be categorized along with the fields of the land. It may be redeemed, so it is to be returned in the jubilee."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 32,
      "text": "'Nevertheless, the cities that belong to the descendants of Levi—that is, the houses in the cities that belong to them—are to belong to the descendants of Levi perpetually as part of their right of redemption."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 33,
      "text": "If someone from the descendants of Levi redeems the houses in the cities that they own, they are to be returned in the jubilee, because the houses of the cities of the descendants of Levi are to remain their property among the Israelis."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 34,
      "text": "Also, the open land of their cities is not to be sold, because it is to remain their perpetual inheritance.'"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 35,
      "text": "If your relative becomes poor so that he is indebted to you, then you are to support him. You are to let him live with you just like the resident alien and the traveler."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 36,
      "text": "You are not to take interest or profit from him. Instead, you are to fear your God and let your relative live with you."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 37,
      "text": "'You are not to loan him money with interest or sell him your food at a profit."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 38,
      "text": "I am the LORD your God, who brought you out of the land of Egypt, to give you the land of Canaan, and to be your God."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 39,
      "text": "'If your brother with you becomes poor, so that he sells himself to you, you are not to make him serve like a bond slave."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 40,
      "text": "Instead, he is to serve with you like a hired servant or traveler who lives with you until the year of jubilee."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 41,
      "text": "Then he and his children with him may leave to return to his family and his ancestor's inheritance."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 42,
      "text": "Since they're my servants whom I've brought out from the land of Egypt, they are not to be sold as slaves."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 43,
      "text": "You are not to rule over them with harshness. You are to fear your God.'"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 44,
      "text": "'As for your male and maid slaves who will be with you, you may buy male and female slaves from among the nations."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 45,
      "text": "You may also buy from resident aliens who live among you and their families who are with you, whom they fathered in your land. They may become your property."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 46,
      "text": "'You may give them as inherited property to your children after you, to own as properties in perpetuity. You may make bond slaves of them, but no one is to rule over his fellow Israeli with harshness."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 47,
      "text": "'If a resident alien or traveler becomes rich, but your relative who lives next to him is so poor that he sells himself to that resident alien or traveler among you or to a member of the resident alien's family,"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 48,
      "text": "he has the right to be redeemed after he sells himself. One of his brothers may redeem him."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 49,
      "text": "His uncle or his uncle's son may redeem him or any blood relative from his clan may redeem him. If he becomes rich, then he may redeem himself."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 50,
      "text": "'He is to bring an accounting to the one who bought him, starting from the year he had sold himself until the year of jubilee. The price of his sale is to correspond to the number of years comparable to the time a hired servant stays with him."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 51,
      "text": "'If there are still many years left, he is to refund the cost of his redemption."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 52,
      "text": "But if only a few years are left until the year of jubilee, he is to bring an accounting of the years that he is to refund for his redemption."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 53,
      "text": "Like a hired servant, he is to remain with him year after year, but he is not to rule over him with what you see as severity."
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 54,
      "text": "'If he isn't redeemed by these, then he is to be set free in the year of jubilee—he and his children with him"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 55,
      "text": "because the Israelis are my servants. They're my servants, since I brought them out of the land of Egypt. I am the LORD your God."
    }
  ]
}
