{
  "book": "Leviticus",
  "chapter": 12,
  "version": "ISV",
  "verses": [
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 1,
      "text": "The LORD spoke to Moses,"
    },
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 2,
      "text": " 'Tell the Israelis that a woman who conceives and bears a son is unclean for seven days. Just like the days of her menstruation, she is unclean."
    },
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 3,
      "text": " On the eighth day, the flesh of the baby's foreskin is to be circumcised."
    },
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 4,
      "text": " For 33 days, she is to remain in purification due to her blood loss. She is not to touch any sacred thing or enter the sanctuary until the days of her purification have been completed."
    },
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 5,
      "text": " 'If she gives birth to a female, then she is to remain unclean for two weeks, just like her menstruation. She is to remain in purification for 66 days due to her blood loss."
    },
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 6,
      "text": " 'When the days of her purification have been completed, whether for her son or daughter, she is to bring to the priest at the entrance of the Tent of Meeting a one year old lamb for a whole burnt offering or a young dove for a sin offering."
    },
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 7,
      "text": " 'He is to offer it in the LORD's presence and make atonement for her so that she becomes clean from her blood loss. This is the law concerning the bearing of a male or female child."
    },
    {
      "book": "Leviticus",
      "chapter": 12,
      "verse": 8,
      "text": " If she cannot afford a goat, then two turtledoves or two young doves, one for a burnt offering and the other for a sin offering, will serve for him to make atonement for her, so that she becomes clean"
    }
  ]
}
