{
  "book": "Leviticus",
  "chapter": 1,
  "version": "ISV",
  "verses": [
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 2,
      "text": "The LORD spoke to Moses from the midst of the Tent of Meeting: "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 2,
      "text": "Speak to the Israelis and tell them, When any person brings an offering to the LORD from among you, whether he brings on offering of animals from either cattle or flock, "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 3,
      "text": "if his offering is a burnt offering from the herd, he is to bring a male without any defect. He is to present it at the entrance of the Tent of Meeting. At the appointed time it is to be presented in the presence of the LORD so that he may be accepted. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 4,
      "text": "He is to lay his hand on the head of the burnt offering, and it will be accepted for him as an atonement on his behalf. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 5,
      "text": "Then he is to slaughter the young bull in the LORD's presence. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 6,
      "text": "He is to skin the burnt offering and cut it into pieces. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 7,
      "text": "Aaron's sons, the priests, are to build a fire on the altar and arrange the wood over the fire. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 8,
      "text": "They are to arrange the pieces of meat—including the head and the fat—on the wood over the fire that burns on the altar. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 9,
      "text": "Then he is to wash its entrails and legs with water. After this, the priest is to offer all of it on the altar—a burnt offering by fire, an aroma that will be pleasing to the LORD. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 10,
      "text": "If his offering is a burnt offering from the flock, whether lamb or goat, he is to bring a male without any defect "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 11,
      "text": "and slaughter it at the north side of the altar in the LORD's presence. Then Aaron's sons, the priests, are to sprinkle its blood around the altar. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 12,
      "text": "He is to cut up its head and fat into separate pieces. Then the priest is to arrange them in rows on the wood over the fire that burns on the altar. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 13,
      "text": "Then he is to wash its entrails and legs with water. After this, the priest is to offer all of it on the altar—a burnt offering by fire, an aroma that will be pleasing to the LORD. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 14,
      "text": "If his offering is a burnt offering of birds to the LORD, he is to bring turtledoves or young doves. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 15,
      "text": "The priest is to bring it to the altar to offer it up in smoke. He is to decapitate it, drain its blood on the side of the altar, "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 16,
      "text": "and then he is to eviscerate it, and throw the viscera and the feathers to the east side of the altar, where the fatty ashes are located. "
    },
    {
      "chapter": 1,
      "book": "Leviticus",
      "verse": 17,
      "text": "He is then to tear it open by its wings, but not dividing it completely into two parts. The priest is then to offer all of it on the wood over the fire as a burnt offering by fire, an aroma pleasing to the LORD. "
    }
  ]
}
