{
  "book": "Leviticus",
  "chapter": 22,
  "version": "ISV",
  "verses": [
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 1,
      "text": "Later on, the LORD spoke to Moses,"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 2,
      "text": "'Tell Aaron and his sons that they are to separate themselves for the sacred things of the Israelis and that they are not to defile my holy name. I am the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 3,
      "text": "'Tell them that whoever among your descendants throughout your generations approaches the sacred things that the Israelis had consecrated to the LORD while still remaining unclean is to be eliminated from my presence. I am the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 4,
      "text": "'If one of Aaron's descendants has an infectious skin disease or a discharge, he is not to eat anything sacred until he has been cleansed. Anyone who touches an unclean thing on account of the dead, or who has a seminal discharge,"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 5,
      "text": "or who becomes unclean by touching a creeping creature or another human being whatever the uncleanness may be—"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 6,
      "text": "such a person who comes in contact with anything like this will become unclean until evening. As a result, he is not to eat the sacred things unless he has bathed himself with water."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 7,
      "text": "When the sun has gone down and he has been cleansed, he may eat of the sacred things, since that's his food."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 8,
      "text": "'He is not to eat a carcass and an animal that was torn by animals, thereby defiling himself with it. I am the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 9,
      "text": "'They are to keep my charge. By doing so, they won't bear the punishment of sin because of it and therefore die if they've been defiled by it. I am the LORD who sets them apart.'"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 10,
      "text": "'No resident alien is to eat anything sacred. Neither the visitor of the priest nor a hired laborer is to eat anything sacred."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 11,
      "text": "If a priest acquires a slave as property with his own money, he may eat with him. Those who were born in his house may eat his food."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 12,
      "text": "'If a priest's daughter marries a resident alien, she is not to eat the sacred raised offerings."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 13,
      "text": "If the priest's daughter is a widow, or is divorced and childless, so that she has to return to her father's house as in her younger days, she may eat her father's food, but no resident alien may eat it."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 14,
      "text": "'If a person eats anything sacred inadvertently; he is to add a fifth part to it and then give the sacred thing to the priest."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 15,
      "text": "'They are not to defile the sacred things of the Israelis that they have offered to the LORD,"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 16,
      "text": "thereby causing them to bear the punishment of their iniquity for wrong doing, when they eat their sacred things, because I am the LORD who sets them apart.'"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 17,
      "text": "The LORD spoke to Moses,"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 18,
      "text": "'Tell Aaron, his sons, and all the Israelis that when a person from the house of Israel or from the resident aliens living in Israel brings his offering to the LORD as a whole burnt offering (whether votive or free will offerings),"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 19,
      "text": "so that you'll be sure to be accepted, he is to offer a male without defect from the bulls, the lamb, and the goats."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 20,
      "text": "'However, whatever has a defect is not to be offered, because it won't be acceptable for you."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 21,
      "text": "'If a person brings a peace offering sacrifice to the LORD to fulfill a vow or a free will offering from the herd or the flock, it is to be sound in order to be accepted, without any defect in it."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 22,
      "text": "'You are not to bring an offering that is blind, fractured, mutilated, or infected with ulcers, scurvy, or scales to the LORD. You are not to present as an offering made by fire any of them on the altar for the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 23,
      "text": "'You may offer a bull or lamb that has one limb longer than the other or that is stunted as a free will offering, but it's not acceptable as a votive offering."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 24,
      "text": "You are not to bring an animal that has been emasculated, crushed, torn, or cut apart to the LORD. You are not to practice this in your land."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 25,
      "text": "A resident alien is not to offer as food to your God any of these items, because they are afflicted with ritual corruption due to their defects. They're not acceptable for you.'"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 26,
      "text": "The LORD told Moses,"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 27,
      "text": "'Whenever a bull, a sheep, or a goat is born, it is to remain for seven days under the care of its mother. But on the eighth day onwards, it may be accepted as an offering made by fire to the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 28,
      "text": "However, you are not to slaughter a bull or a ewe along with its offspring on the same day."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 29,
      "text": "When you offer a sacrifice of thanksgiving to the LORD, bring it so that it's acceptable for you."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 30,
      "text": "It is to be eaten that same day. You are not to leave any of it until morning. I am the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 31,
      "text": "'Keep my commands and observe them. I am the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 32,
      "text": "'You are not to defile my sacred name, because I've been set apart in the midst of the Israelis. Furthermore, I am the LORD who sets you apart,"
    },
    {
      "book": "Leviticus",
      "chapter": 22,
      "verse": 33,
      "text": "who brought you out of the land of Egypt to be your God. I am the LORD."
    }
  ]
}
