{
  "book": "Leviticus",
  "chapter": 9,
  "version": "ISV",
  "verses": [
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 1,
      "text": "Eight days later, Moses called Aaron, his sons, and the elders of Israel."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 2,
      "text": "He told Aaron, 'Take a young calf for a sin offering and a ram without defects for a whole burnt offering and bring them into the LORD's presence.'"
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 3,
      "text": "He also told the Israelis, 'Bring a male goat for a sin offering, a calf, a year old lamb without defects for a whole burnt offering,"
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 4,
      "text": "an ox, a ram for a peace offering to sacrifice in the LORD's presence, and a grain offering with olive oil, because on that day the LORD will appear to you.'"
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 5,
      "text": "So they brought what Moses had commanded to the entrance of the Tent of Meeting. The entire congregation drew near and stood in the LORD's presence."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 6,
      "text": "Then Moses said, 'This is what the LORD commanded you to do so that the glory of the LORD may be revealed to you.'"
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 7,
      "text": "Moses then told Aaron, 'Approach the altar and bring your sin and whole burnt offerings. Make atonement for yourself and the people. Then bring the people's offering and make atonement for them, as the LORD commanded.'"
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 8,
      "text": "So Aaron drew near to the altar and slaughtered the calf for a sin offering on behalf of himself."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 9,
      "text": "Next, Aaron's sons brought the blood to him and he dipped his fingers in the blood and placed it on the horns of the altar. As to the rest of the blood, he poured it at the base of the altar."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 10,
      "text": "He incinerated the fat, kidneys, and the appendage from the liver of the sin offering, just as the LORD had commanded Moses."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 11,
      "text": "He also incinerated the meat and skin outside the camp."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 12,
      "text": "And so the burnt offering was slaughtered, and Aaron's sons secured for him the blood, which he poured on the altar and around it."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 13,
      "text": "As for the burnt offering, they delivered it to Aaron piece by piece, but he burned the head on the altar."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 14,
      "text": "He washed the internal organs and the thighs and incinerated them on the altar, along with the whole burnt offering."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 15,
      "text": "He brought the people's offering, presenting a goat for a sin offering on behalf of the people. He slaughtered it and offered it as the first sin offering."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 16,
      "text": "Then he brought the whole burnt offering and offered it according to procedure."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 17,
      "text": "Next, he brought the grain offering, filled his hand with it, and burned it on the altar next to the burnt offering for that morning."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 18,
      "text": "He slaughtered the ox and ram for the peace offering sacrifice on behalf of the people. Aaron's sons delivered the blood to him, which he poured on the altar and around it."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 19,
      "text": "As to the fat from the ox, ram, and the tail, the fat covering the kidneys, and the appendage of the liver,"
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 20,
      "text": "they placed the fat on the breast and then he burned the fat on the altar."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 21,
      "text": "Aaron waved the breast and the right thigh as a raised offering in the LORD's presence, just as Moses had commanded."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 22,
      "text": "Aaron raised his hand toward the people and blessed them. Then he came down from the altar after offering the sin, whole burnt, and peace offerings."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 23,
      "text": "Moses and Aaron entered the Tent of Meeting. When they came out, they blessed the people and the glory of the LORD appeared to all the people."
    },
    {
      "book": "Leviticus",
      "chapter": 9,
      "verse": 24,
      "text": "A fire came down from the LORD's presence and consumed the burnt offering on the altar as well as the fat. When the people saw it, they shouted and fell on their face"
    }
  ]
}
