{
  "book": "Leviticus",
  "chapter": 10,
  "version": "ISV",
  "verses": [
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 1,
      "text": "Aaron's sons Nadab and Abihu each took his own censer, placed fire in them, covered it with incense, and brought it into the LORD's presence as unauthorized fire that he had never prescribed for them."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 2,
      "text": "So a fire came out from the LORD's presence, incinerated them, and they died while in the LORD's presence."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 3,
      "text": "Moses spoke with Aaron about what the LORD had said: 'Among those who are near me, I'll show myself holy so that I'll be glorified before all people.' So Aaron remained silent."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 4,
      "text": "Then Moses called on Mishael and Elzaphan, the sons of Uzziel, Aaron's uncle, and said: 'Come here and carry your brothers away from the sanctuary, outside the camp.'"
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 5,
      "text": "So they approached to carry them in their tunic outside the camp, just as Moses had commanded."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 6,
      "text": "Then Moses told Aaron and his sons Eleazar and Ithamar: 'You are not to loosen the hair of your head and you are not to rend your clothes. That way, you won't die and wrath won't come on the entire congregation. Your brothers and the assembly of Israel will mourn because of the fire that the LORD kindled."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 7,
      "text": "Also, you are not to leave the entrance of the Tent of Meeting. Otherwise, you'll die, since the LORD's anointing oil remains on you.' So they followed Moses' instructions."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 8,
      "text": "Then the LORD spoke to Aaron:"
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 9,
      "text": "'You and your sons with you are not to drink wine—that is, any intoxicating drink—when you enter the Tent of Meeting. That way, you won't die. This is to be a perpetual statute throughout your generations."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 10,
      "text": "'Differentiate between what's sacred and common and between what's unclean and clean."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 11,
      "text": "Teach the Israelis all the statutes that the LORD had commanded you by the authority of Moses.'"
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 12,
      "text": "Then Moses spoke to Aaron and his sons Eleazar and Ithamar: 'Take the leftovers from the grain offering and the offerings made by fire and eat the unleavened bread beside the altar, because it is most holy to the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 13,
      "text": "Eat at a sacred place, because it's your and your son's prescribed portions. It's from the offering made by fire to the LORD, since I've commanded it."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 14,
      "text": "As to the breast and thigh raised offerings, you and your sons and daughters with you may eat them at a clean place, because it belongs to you and is your sons' prescribed portions. They were taken from the sacrifices of peace offering of the Israelis."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 15,
      "text": "They are to bring the thigh offering and the breast raised offering with the offerings made by fire from the fat to wave as a raised offering in the LORD's presence. It will be a perpetual portion for you and your sons with you, just as the LORD had commanded.'"
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 16,
      "text": "Now, Moses diligently sought for the goat that had been offered as a sin offering, but it had already been incinerated, so he was angry with Aaron's sons who remained. He asked Eleazar and Ithamar,"
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 17,
      "text": "'Why didn't you eat the sin offering at the sacred place? It's most holy and he has given it to you so that you may bear the punishment for the iniquity of the entire congregation and make atonement for them in the LORD's presence."
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 18,
      "text": "Look! Its blood wasn't brought inside the sanctuary. You are to have eaten it in the sanctuary, just as I've commanded.'"
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 19,
      "text": "But Aaron replied to Moses, 'Today they've offered their sin and whole burnt offerings in the LORD's presence. Yet things such as these have happened to me. Had I eaten the sin offering today, would that be pleasing in the LORD's opinion?'"
    },
    {
      "book": "Leviticus",
      "chapter": 10,
      "verse": 20,
      "text": "When Moses heard that explanation, he was please"
    }
  ]
}
