{
  "book": "Leviticus",
  "chapter": 17,
  "version": "ISV",
  "verses": [
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 1,
      "text": "The LORD spoke to Moses,"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 2,
      "text": "'Speak to Aaron, his sons, and all the Israelis and tell them that this is what the LORD has commanded."
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 3,
      "text": "When a person from the house of Israel slaughters an ox, a lamb, or a goat, whether in the camp or outside the camp,"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 4,
      "text": "but fails to bring it to the entrance of the Tent of Meeting as an offering in the presence of the tent of the LORD, that person will incur blood guiltiness. Because he has shed blood, that person is to be eliminated from contact with his people.'"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 5,
      "text": "'This statute is required so that the Israelis may bring their sacrifices that they are sacrificing in the open field to the LORD, to the priest at the entrance of the Tent of Meeting, where they are to slaughter their peace offering to the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 6,
      "text": "The priest is to spatter the blood on the LORD's altar at the entrance of the Tent of Meeting and incinerate the fat, making a pleasing aroma to the LORD."
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 7,
      "text": "They are no longer to slaughter their sacrifices to the goat demons, with whom they have committed prostitution. This will be a perpetual statute for you throughout your generations.'"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 8,
      "text": "'Tell them that if a person from the house of Israel or a resident alien who lives among you brings a whole burnt offering or a sacrifice"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 9,
      "text": "to the entrance of the Tent of Meeting, but fails to bring it to offer it to the LORD, that person is to be eliminated from contact with his people.'"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 10,
      "text": "'If anyone from the house of Israel or a resident alien who lives among them eats any form of blood, I'll oppose that person who ate the blood and eliminate him from his people,"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 11,
      "text": "because the life of the flesh is in the blood itself, and I myself have given it to you all so that atonement may be made for your souls on the altar, since the blood itself makes atonement through the life that is in it."
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 12,
      "text": "This is why I've told the Israelis that no person among you is to eat blood. Even the resident alien who lives among you is not to eat blood."
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 13,
      "text": "'If a person from the house of Israel or a resident alien who lives among you has hunted live game or a bird that may be eaten, he is to extract its blood and cover it with soil,"
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 14,
      "text": "because the life of any flesh is the blood itself. Therefore I'm saying to the Israelis that the blood of any flesh is not to be eaten, because the life of any flesh is in its blood. Anyone who eats of it is to be eliminated from contact with his people."
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 15,
      "text": "'Any person who eats a carcass or an animal that was torn by beasts, whether that person is native born or a resident alien, is to wash his clothes and bathe himself with water, and he will remain unclean until evening, and then he'll become clean."
    },
    {
      "book": "Leviticus",
      "chapter": 17,
      "verse": 16,
      "text": "But if he doesn't wash or bathe his body, then he is to bear the punishment of his iniquity."
    }
  ]
}
