39.1  And  it  will  come  to  pass  in these days that the chosen and holy children will come down from the high Heavens  and  their  offspring  will become one with the sons of men.
39.2   In   those   days   Enoch   received books of indignation and anger and books of tumult and confusion.   And there will be no mercy for them, says the Lord of Spirits.
39.3  And  at  that  time  clouds  and  a storm wind carried me off from the face of the earth and set me down at the end of Heaven.
39.4 And there I saw another vision; the Dwelling of the Righteous and the Resting-Places of the Holy.
39.5 There my eyes saw their dwelling with the Angels, and their resting places with the Holy Ones, and they were petitioning  and  supplicating  and praying, on behalf of the sons of men; and righteousness, like water, flowed in front of them, and mercy like dew on the ground.   Thus it is among them forever and ever.
39.6 And in those days my eyes saw the Place of the Chosen Ones of Righteousness and Faith; and there will be righteousness in their days, and the righteous and chosen will be without number, in front of him, forever and ever.
39.7 And I saw their dwelling, under the Wings of the Lord of Spirits, and all the righteous and chosen shone in front of him, like the light of fire.  And their mouths were full of blessing, and their lips praised the name of the Lord of Spirits.  And righteousness will not fail in front of him, and truth will not fail in front of him.
39.8 There I wished to dwell, and my

soul longed for that dwelling; there had my lot been assigned before, for thus it was decided about me, in front of the Lord of Spirits.
39.9 And in those days I praised and exalted the name of the Lord of Spirits, with blessing and praise, for he has destined me for blessing and praise, in accordance with the Lord of Spirits.
39.10 And for a long time my eyes looked at that place, and I blessed him and  praised  him,  saying:    "Blessed  is He, and may He be blessed from the beginning and for ever!"
39.11 And in his presence there is no end.   He knew before the world was created what the world would be, even for all the generations that are to come.
39.12  Those  who  do  not  sleep  bless you, and they stand before Your Glory, and bless and praise and exalt, saying: "Holy, Holy, Holy, Lord of Spirits; he fills the earth with spirits."
39.13 And there, my eyes saw all those who do not sleep; standing in front of Him,  and  blessing,  and  saying: "Blessed are you, and blessed is the name of the Lord, for ever and ever!"
39.14  And  my  face  was  transformed until I was unable to see.